tests/load/websocket-load-test.yml
config:
  target: "ws://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up - 5 users/sec"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load - 10 users/sec"
    - duration: 60
      arrivalRate: 20
      name: "Stress test - 20 users/sec"
    - duration: 30
      arrivalRate: 50
      name: "Peak load - 50 users/sec"
  engines:
    ws: {}
  processor: "./processor.js"

scenarios:
  - name: "WebSocket Connection Lifecycle"
    engine: ws
    weight: 50
    flow:
      - log: "Connecting to WebSocket..."
      - connect:
          url: "/"
      - think: 2
      - log: "Sending ping..."
      - send: '{"type":"ping"}'
      - think: 1
      - log: "Subscribing to AI205/data..."
      - send: '{"type":"subscribe","topic":"AI205/data"}'
      - think: 30
      - log: "Sending pong..."
      - send: '{"type":"pong"}'
      - think: 10
      - log: "Disconnecting..."

  - name: "Long-lived Connection"
    engine: ws
    weight: 30
    flow:
      - connect:
          url: "/"
      - send: '{"type":"ping"}'
      - think: 5
      - send: '{"type":"subscribe","topic":"AI205/data"}'
      - loop:
        - think: 30
        - send: '{"type":"pong"}'
        count: 10

  - name: "Rapid Connect/Disconnect"
    engine: ws
    weight: 20
    flow:
      - loop:
        - connect:
            url: "/"
        - think: 1
        - send: '{"type":"ping"}'
        - think: 2
        count: 5